# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3_DualConv, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3_DualConv, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3_DualConv, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3_DualConv, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head (after removing P4 and P5)
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # Upsample to P4
   [[-1, 6], 1, Concat, [1]],  # Concatenate with backbone P4
   [-1, 3, C3_DualConv, [512]],  # 13 (P4/16)

   # We need to adjust the concatenation and detection
   # Removing P4/16 and P5/32 layers, just use P3/8 
   [[13], 1, Detect, [nc, anchors]],  # Only Detect P3/8 (smaller head)
  ]
