# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 10  # number of classes (CIFAR-10 has 10 classes)
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: []  # No anchors needed for classification

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head (for classification)
head: [
    [-1, 1, Conv, [512, 1, 1]],  # Apply a convolution for feature map reduction
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]],  # concatenate backbone P4
    [-1, 3, C3, [512, False]],  # 13

    [-1, 1, Conv, [256, 1, 1]],  # Apply another conv for further feature reduction
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]],  # concatenate backbone P3
    [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]],  # concatenate head P4
    [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]],  # concatenate head P5
    [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

    # Modify detection head to be a classification head (output 10 classes)
    [-1, 1, Conv, [10, 1, 1]],  # Output layer with 10 classes (for CIFAR-10)
    [-1, 1, nn.Softmax, [1]],  # Apply softmax to get class probabilities
]
